<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Wickr Pro disk image.</string>
    <key>Identifier</key>
    <string>com.github.bahrabd.download.wickrpro</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>WickrPro</string>
        <key>DOWNLOAD_URL</key>
        <string>https://s3.amazonaws.com/static.wickr.com/downloads/mac/pro/WickrPro-5.77.12.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/WickrPro.app</string>
                <key>strict_verification</key>
                <false/>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.wickr.WickrProMac" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = W8RC3R952A)</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
